# SiteSubRegion Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SiteSubRegion Properties
SiteSubRegion Class See Also
---
The SiteSubRegion type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostId | The element id of the topography surface hosting this SiteSubRegion. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| TopographySurface | The TopographySurface element which this SiteSubRegion represents. |

# See Also
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace